In [15]:
import numpy as np
import pandas as pd

## 2. Intro to Pandas

### 2.1 Pandas objects

<b>We'll be looking at two main objects of the Pandas library namely, Series and DataFrames.</b>

#### 2.1.1 Series
A series object is one-dimensional array/list of values that are indexed. Think of it like an indexed 'series' of values. 
<br>Let's look at some examples:

In [69]:
# List -> Series
numbers = pd.Series([1, 2, 3.4, 5.67, 8, 0.9])

names = pd.Series(['Alane', 'Ayanna', 'Tyisha', 'Jarvis', 'Tabetha', 'Geoffrey', 'Ken'])

print(numbers, '\n')
print(names)

0    1.00
1    2.00
2    3.40
3    5.67
4    8.00
5    0.90
dtype: float64

0       Alane
1      Ayanna
2      Tyisha
3      Jarvis
4     Tabetha
5    Geoffrey
6         Ken
dtype: object

As you can see a default index is added to the list of values. Lets add a <b>custom index</b>.

In [38]:
custom_index = 'abcdef'

# Please note how we use the attribute 'values' for a series object
numbers2 = pd.Series(numbers.values, index=list(custom_index))

numbers2

a    1.00
b    2.00
c    3.40
d    5.67
e    8.00
f    0.90
dtype: float64

Let's look at the values in the series objects we've created, using indexes.

In [47]:
print('The second value in series numbers is: ', numbers[1], '\n')

print('The second value in series numbers2 is: ', numbers2['b'])

The second value in series numbers is:  2.0

The second value in series numbers2 is:  2.0

Another way to address it using indices can be the following:

In [61]:
print('The first three values in series numbers2 are:')

print(numbers2[:'c']) # numbers2['a':'c'] or numbers2[:3] or numbers2[1:3] or numbers2[:-3] work the same

The first three values in series numbers2 are:
a    1.0
b    2.0
c    3.4
dtype: float64

Let's look at another way that we can create a series object: <b>Dictionaries</b>

In [76]:
locations_dict = {0:'California', 1:'New York', 2:'Virginia', 3:'Michigan', 4:'Texas', 5:'Nevada', 6:'Illinois'}

locations = pd.Series(locations_dict)

locations

0    California
1      New York
2      Virginia
3      Michigan
4         Texas
5        Nevada
6      Illinois
dtype: object

#### 2.1.2 Data Frames
Pandas DataFrame object is generally a two-dimensional, size mutable, potentially heterogeneous tabular data with axes that are labeled. It can be considered to be a special form of a Python dictionary or a numpy array.
<br>Let's look at some examples:

In [218]:
# one of the most common ways to create a data frame
age = {0:5, 1:21, 2:12, 3:10, 4:30, 5:13, 6:70}

data1 = pd.DataFrame({'Name': names, 'Age': age, 'Location': locations})

data1

       Name  Age    Location
0     Alane    5  California
1    Ayanna   21    New York
2    Tyisha   12    Virginia
3    Jarvis   10    Michigan
4   Tabetha   30       Texas
5  Geoffrey   13      Nevada
6       Ken   70    Illinois

Let's play with the index a little (both the column and row index) while introducing a new way to create a data frame with pandas (using an existing data frame).

In [219]:
data2 = pd.DataFrame(data=data1).set_index('Name', drop=True)

data2

          Age    Location
Name
Alane       5  California
Ayanna     21    New York
Tyisha     12    Virginia
Jarvis     10    Michigan
Tabetha    30       Texas
Geoffrey   13      Nevada
Ken        70    Illinois

Let's create a data frame using <b>numpy arrays</b>.

In [220]:
data3 = pd.DataFrame(np.arange(12).reshape(6, 2), columns=['Even', 'Odd'], index=list(custom_index))

data3

   Even  Odd
a     0    1
b     2    3
c     4    5
d     6    7
e     8    9
f    10   11

### 2.2 Selection and Indexing of Data in Pandas

Let's look at a couple of ways we access the columns of a data frame in pandas.
<br><b>Note</b>: For this section, we'll use the '<b>data2</b>' data frame created earlier.

In [221]:
data2['Age']

Name
Alane        5
Ayanna      21
Tyisha      12
Jarvis      10
Tabetha     30
Geoffrey    13
Ken         70
Name: Age, dtype: int64

In [222]:
data2.Age

Name
Alane        5
Ayanna      21
Tyisha      12
Jarvis      10
Tabetha     30
Geoffrey    13
Ken         70
Name: Age, dtype: int64

In [223]:
data2.Age is data2['Age']

True

Both the above usages give the same result.

Now, we'll use this to operate on our data. We'll see how we can create a new column and enter values in that column by operating on an existing column.
<br><br>Let's say that the 'Age' information in the dataset is 10 years old and we need to add a new column that has the adjusted values. Following is how we can accomplish that:

In [224]:
data2['Age_current'] = data2['Age'] + 10

data2

          Age    Location  Age_current
Name
Alane       5  California           15
Ayanna     21    New York           31
Tyisha     12    Virginia           22
Jarvis     10    Michigan           20
Tabetha    30       Texas           40
Geoffrey   13      Nevada           23
Ken        70    Illinois           80

We can also use same sized multiple series of data to perform similar operations.

Now we'll look at some attributes that can be used by a pandas DataFrame object.

In [225]:
# columns
data2.columns

Index(['Age', 'Location', 'Age_current'], dtype='object')

In [226]:
# index
data2.index

Index(['Alane', 'Ayanna', 'Tyisha', 'Jarvis', 'Tabetha', 'Geoffrey', 'Ken'], dtype='object', name='Name')

In [227]:
# values
data2.values

array([[5, 'California', 15],
       [21, 'New York', 31],
       [12, 'Virginia', 22],
       [10, 'Michigan', 20],
       [30, 'Texas', 40],
       [13, 'Nevada', 23],
       [70, 'Illinois', 80]], dtype=object)

In [228]:
# indexing the values
data2.values[1]

array([21, 'New York', 31], dtype=object)

Now, let's look at a bit more sophisticated methods for indexing.
<br>We'll use the following:
1. <b>iloc</b>: simple array like implicit integer indexer
2. <b>loc</b>: uses explict index and column names

In [229]:
# first two columns and all rows except the first
data2.iloc[1:, :2]

          Age  Location
Name
Ayanna     21  New York
Tyisha     12  Virginia
Jarvis     10  Michigan
Tabetha    30     Texas
Geoffrey   13    Nevada
Ken        70  Illinois

In [230]:
# first two columns and all rows except the first
data2.loc['Tyisha':, :'Location']

          Age  Location
Name
Tyisha     12  Virginia
Jarvis     10  Michigan
Tabetha    30     Texas
Geoffrey   13    Nevada
Ken        70  Illinois

Let's use what we've learned in this section to apply a mask to our data and output only selected columns like we would do using an SQL query.

In [231]:
data2.loc[data2.Age_current > 25, ['Age_current', 'Location']]

         Age_current  Location
Name
Ayanna            31  New York
Tabetha           40     Texas
Ken               80  Illinois

### 2.3 Handling missing values in Pandas

Pandas uses two types of sentinels for representing null values and those are <b>None</b> and <b>NaN</b>.
1. A <b>None</b> value is a python object generally used for representing null values in numpy arrays.
2. A <b>NaN</b> value is a floating point value. When operating on data with 'NaN' values the operations tend to give out unwanted results.
<br>We'll look at both in the following cells:

In [232]:
missing1 = np.array([1, 2, 3, None])
missing1

array([1, 2, 3, None], dtype=object)

In [233]:
missing2 = np.array([1, 2, 3, np.nan])
missing2
# missing2.dtype

array([ 1.,  2.,  3., nan])

In [234]:
# operating a value with NaN will result in NaN
print('Addition: (0 + {}) = {}'.format(np.nan, (0+np.nan)))
print('Multiplication: (1 * {}) = {}'.format(np.nan, (1*np.nan)))

Addition: (0 + nan) = nan
Multiplication: (1 * nan) = nan

<br>In Pandas, 'None' values are interchanged into 'NaN' values due to type casting as and when required. Let's look at an example:

In [235]:
# example = pd.Series([1, 2, 3])
example = pd.Series([1, 2, np.nan, 3, None])
example

0    1.0
1    2.0
2    NaN
3    3.0
4    NaN
dtype: float64

<br>Now we'll se how we can operate on null values in pandas. Following are some functions we'll be looking at:
1. isnull( )
2. notnull( )
3. fillna( )
4. dropna( )

In [236]:
# isnull returns a boolean mask for the data
example.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [237]:
# notnull also returns a boolean mask for the data but it's opposite to isnull
example.notnull()

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [238]:
# use either of those masks to access the data
example[example.notnull()]

0    1.0
1    2.0
3    3.0
dtype: float64

Now we'll use the pandas data frame to see how the functions <b>fillna( )</b> and <b>dropna( )</b> work.

In [253]:
missing3 = data1.copy()
missing3.loc[3:5, 'Age'] = np.nan
missing3

       Name   Age    Location
0     Alane   5.0  California
1    Ayanna  21.0    New York
2    Tyisha  12.0    Virginia
3    Jarvis   NaN    Michigan
4   Tabetha   NaN       Texas
5  Geoffrey   NaN      Nevada
6       Ken  70.0    Illinois

In [254]:
# dropping rows with null values
missing3.dropna(inplace=False)

     Name   Age    Location
0   Alane   5.0  California
1  Ayanna  21.0    New York
2  Tyisha  12.0    Virginia
6     Ken  70.0    Illinois

In [255]:
# let's fill these values with the average of the non-null values.
missing3.fillna(missing3.dropna()['Age'].mean(), inplace=True)
missing3

       Name   Age    Location
0     Alane   5.0  California
1    Ayanna  21.0    New York
2    Tyisha  12.0    Virginia
3    Jarvis  27.0    Michigan
4   Tabetha  27.0       Texas
5  Geoffrey  27.0      Nevada
6       Ken  70.0    Illinois

### 2.4 Combining Datasets

#### 2.4.1 concat( ) and append( )
First we'll look at some simple functions that are used to combine datasets, <b>concat( ) and append( )</b>.
<br>Let's look at pd.concat( ) first. 
<br><b>Note</b>: We'll use data frames for our examples, but series can be used just the same.

In [264]:
# create two new data frames
sample1 = pd.DataFrame(data={'A':[1, 2], 'B':[3, 4]}, index=[0, 1])
sample2 = pd.DataFrame(data={'A':[5, 6], 'B':[7, 8]}, index=[0, 1])
display('sample1', sample1, 'sample2', sample2)

'sample1'

   A  B
0  1  3
1  2  4

'sample2'

   A  B
0  5  7
1  6  8

In [265]:
# now we'll see 2 ways of concatinating them

# row-wise concatenation
sample3 = pd.concat([sample1, sample2], axis=0)

# column-wise concatenation
sample4 = pd.concat([sample1, sample2], axis=1)

display('sample3',sample3, 'sample4', sample4)

'sample3'

   A  B
0  1  3
1  2  4
0  5  7
1  6  8

'sample4'

   A  B  A  B
0  1  3  5  7
1  2  4  6  8

An important parameter for this function is '<b>join</b>'. Let's look at an example:

In [266]:
# create two new dataframes
sample5 = sample1.copy()
sample6 = pd.DataFrame(data={'B':[9, 10], 'C':[11, 12]}, index=[0, 1])

display('sample5', sample5, 'sample6', sample6)

'sample5'

   A  B
0  1  3
1  2  4

'sample6'

    B   C
0   9  11
1  10  12

In [267]:
# join these data frames over B using pd.concat()
display('Joined', pd.concat([sample5, sample6], join='inner'))

'Joined'

    B
0   3
1   4
0   9
1  10

Now, we'll look at <b>append( )</b> function. Though it gives a simmilar result as <b>concat( )</b> gives, but is a bit limited in its implementation as it only 'appends' row-wise.

In [268]:
display('append', sample1.append(sample2))

'append'

   A  B
0  1  3
1  2  4
0  5  7
1  6  8

#### 2.4.2 Merge and Join
Now we'll look at some of the more sophisticated methods for combining datasets.
<br>First we'll see how to 'merge' datasets. We'll do that using <b>pd.merge( )</b>.

In [273]:
left = pd.DataFrame({'A': [1, 2], 'B': [2, 3]})
right = pd.DataFrame({'A': [4, 5, 6], 'B': [2, 2, 2]})

display('left', left, 'right', right)

'left'

   A  B
0  1  2
1  2  3

'right'

   A  B
0  4  2
1  5  2
2  6  2

In [274]:
# outer join over column 'B'
merger = pd.merge(left, right, on='B', how='outer', indicator=True)
merger

   A_x  B  A_y     _merge
0    1  2  4.0       both
1    1  2  5.0       both
2    1  2  6.0       both
3    2  3  NaN  left_only

In addition to columns, we can also merge on index.

In [316]:
# create new data frames
df1 = pd.DataFrame({'Age':list(age.values())}, index=names)
df2 = pd.DataFrame({'Dept_ID':[1, 2, 3, 4, 1, 3, 1]}, index=names)
display('df1', df1, 'df2', df2)

'df1'

          Age
Alane       5
Ayanna     21
Tyisha     12
Jarvis     10
Tabetha    30
Geoffrey   13
Ken        70

'df2'

          Dept_ID
Alane           1
Ayanna          2
Tyisha          3
Jarvis          4
Tabetha         1
Geoffrey        3
Ken             1

In [317]:
# let's use index to merge
pd.merge(df1, df2, left_index=True, right_index=True)

          Age  Dept_ID
Alane       5        1
Ayanna     21        2
Tyisha     12        3
Jarvis     10        4
Tabetha    30        1
Geoffrey   13        3
Ken        70        1

The <b>join( )</b> function does the same thing as it primarily works on index.

In [318]:
df3 = df1.join(df2)
df3

          Age  Dept_ID
Alane       5        1
Ayanna     21        2
Tyisha     12        3
Jarvis     10        4
Tabetha    30        1
Geoffrey   13        3
Ken        70        1

Now let's look at how we would merge data frames with different sizes and columns.

In [319]:
# data frame for department 
df4 = pd.DataFrame({'Department_ID':[1, 2, 3, 4, 5], 'Department':['CSE', 'FRE', 'ECE', 'DS', 'BIO']})
df4

   Department_ID Department
0              1        CSE
1              2        FRE
2              3        ECE
3              4         DS
4              5        BIO

This data frame is strictly dedicated to the information about a department. 'DepartmentID' is the identifying column (primary key) in this case while it's also present in 'df3' as 'DeptID' (as the foreign key) which has the information about person name and their age. Now we'll see ways to combine these datasets.
<br>As the names of the department ID columns are different in both dataframes, instead of just using the 'on' parameter as earlier, we'll have to specify columns from both of them data frames on which to join/merge.

In [320]:
# inner join
pd.merge(df3, df4, left_on='Dept_ID', right_on='Department_ID', how='inner')

   Age  Dept_ID  Department_ID Department
0    5        1              1        CSE
1   30        1              1        CSE
2   70        1              1        CSE
3   21        2              2        FRE
4   12        3              3        ECE
5   13        3              3        ECE
6   10        4              4         DS

In [321]:
# outer join
pd.merge(df4, df3, left_on='Department_ID', right_on='Dept_ID', how='outer', indicator=True)

   Department_ID Department   Age  Dept_ID     _merge
0              1        CSE   5.0      1.0       both
1              1        CSE  30.0      1.0       both
2              1        CSE  70.0      1.0       both
3              2        FRE  21.0      2.0       both
4              3        ECE  12.0      3.0       both
5              3        ECE  13.0      3.0       both
6              4         DS  10.0      4.0       both
7              5        BIO   NaN      NaN  left_only

### 2.5 Grouping and Aggregation

In this section we'll see how we can leverage the properties of a data frame and perform certain groupings and aggregations to better understand the data. Let's look at some examples.

In [323]:
# new series for number of hours worked
hours = pd.Series([30, 21, 40, 40, 35, 50, 15])
hours

0    30
1    21
2    40
3    40
4    35
5    50
6    15
dtype: int64

In [326]:
# simple aggregations on series
print('Hours sum:', hours.sum())
print('Hours mean', hours.mean())

Hours sum: 231
Hours mean 33.0

In [334]:
# add hours to df1
df1['Hrs_Worked/week'] = hours.values
df1

          Age  Hrs_Worked/week
Alane       5               30
Ayanna     21               21
Tyisha     12               40
Jarvis     10               40
Tabetha    30               35
Geoffrey   13               50
Ken        70               15

In [336]:
# calculate mean column-wise
df1.mean()

Age                23.0
Hrs_Worked/week    33.0
dtype: float64

In [337]:
# calculate mean row-wise
df1.mean(axis='columns')

Alane       17.5
Ayanna      21.0
Tyisha      26.0
Jarvis      25.0
Tabetha     32.5
Geoffrey    31.5
Ken         42.5
dtype: float64

Let's look at the <b>describe( )</b> function that is usually used to look at these aggregations in a data frame.

In [338]:
# describe()
df1.describe()

             Age  Hrs_Worked/week
count   7.000000         7.000000
mean   23.000000        33.000000
std    22.271057        12.027746
min     5.000000        15.000000
25%    11.000000        25.500000
50%    13.000000        35.000000
75%    25.500000        40.000000
max    70.000000        50.000000

Now, we'll look at how to group the data and perform operations. This is one of the most important and widely used transformation on data frames.
<br>The function we'll use here is <b>groupby( )</b>.

In [344]:
# new data frame with Dept_ID
df5 = df1.join(df2).reset_index().rename(columns={'index':'Name'})
df5

       Name  Age  Hrs_Worked/week  Dept_ID
0     Alane    5               30        1
1    Ayanna   21               21        2
2    Tyisha   12               40        3
3    Jarvis   10               40        4
4   Tabetha   30               35        1
5  Geoffrey   13               50        3
6       Ken   70               15        1

Aggregations on <b>groupby( )</b>.

In [356]:
# display names of people with maximum age in each department
df5.groupby('Dept_ID')['Name', 'Age'].max()

            Name  Age
Dept_ID
1        Tabetha   70
2         Ayanna   21
3         Tyisha   13
4         Jarvis   10

Filtering on <b>groupby( )</b>.

In [368]:
# display departments with minimum age greater than 10
df5.groupby('Dept_ID').filter(lambda x: x['Age'].min()>10)

       Name  Age  Hrs_Worked/week  Dept_ID
1    Ayanna   21               21        2
2    Tyisha   12               40        3
5  Geoffrey   13               50        3

Applying functions over dataframe after <b>groupby( )</b>.

In [369]:
# normalize hours worked per week for each department
def func_normalize(x):
    x['Hrs_Worked/week'] = x['Hrs_Worked/week']/(x['Hrs_Worked/week'].sum())
    return x
    
df5.groupby('Dept_ID').apply(func_normalize)

       Name  Age  Hrs_Worked/week  Dept_ID
0     Alane    5         0.375000        1
1    Ayanna   21         1.000000        2
2    Tyisha   12         0.444444        3
3    Jarvis   10         1.000000        4
4   Tabetha   30         0.437500        1
5  Geoffrey   13         0.555556        3
6       Ken   70         0.187500        1

### 2.6 Importing data in Pandas

Here we'll look at one of the most common file formats used i.e. CSV.
<br>There are many more formats supported by pandas. For the purpose of this exercise, we'll only look at importing CSV files.

In [375]:
# get US states data 
population = pd.read_csv('data-USstates/state-population.csv')
area = pd.read_csv('data-USstates/state-areas.csv')
abbrev = pd.read_csv('data-USstates/state-abbrevs.csv')

In [376]:
population.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [377]:
area.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [378]:
abbrev.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

Let's apply what we learned above and merge these three files.

In [386]:
df6 = pd.merge(area, abbrev, on='state')
df6.head()

        state  area (sq. mi) abbreviation
0     Alabama          52423           AL
1      Alaska         656425           AK
2     Arizona         114006           AZ
3    Arkansas          53182           AR
4  California         163707           CA

In [388]:
df7 = pd.merge(population, df6, left_on='state/region', right_on='abbreviation', how='outer').drop('abbreviation', axis=1)
df7.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [389]:
df7.describe()

              year    population  area (sq. mi)
count  2544.000000  2.524000e+03    2448.000000
mean   2001.500000  6.805558e+06   74252.627451
std       6.923547  2.855014e+07   94929.655186
min    1990.000000  1.013090e+05      68.000000
25%    1995.750000  7.423805e+05   35387.000000
50%    2001.500000  1.597005e+06   56276.000000
75%    2007.250000  4.547104e+06   84904.000000
max    2013.000000  3.161288e+08  656425.000000

In [400]:
# finally lets apply a grouping to this data
df7.groupby(['state/region', 'ages', 'year'])[df7.columns].filter(
    lambda x: x['population'].min()>3000000 and x['area (sq. mi)'].min()>50000
)

     state/region   ages  year  population       state  area (sq. mi)
1              AL  total  2012   4817528.0     Alabama        52423.0
3              AL  total  2010   4785570.0     Alabama        52423.0
5              AL  total  2011   4801627.0     Alabama        52423.0
6              AL  total  2009   4757938.0     Alabama        52423.0
9              AL  total  2013   4833722.0     Alabama        52423.0
10             AL  total  2007   4672840.0     Alabama        52423.0
12             AL  total  2008   4718206.0     Alabama        52423.0
14             AL  total  2005   4569805.0     Alabama        52423.0
16             AL  total  2006   4628981.0     Alabama        52423.0
18             AL  total  2004   4530729.0     Alabama        52423.0
20             AL  total  2003   4503491.0     Alabama        52423.0
22             AL  total  2001   4467634.0     Alabama        52423.0
24             AL  total  2002   4480089.0     Alabama        52423.0
27             AL  total  1999   4430141.0     Alabama        52423.0
28             AL  total  2000   4452173.0     Alabama        52423.0
30             AL  total  1998   4404701.0     Alabama        52423.0
33             AL  total  1997   4367935.0     Alabama        52423.0
34             AL  total  1996   4331103.0     Alabama        52423.0
35             AL  total  1995   4296800.0     Alabama        52423.0
38             AL  total  1994   4260229.0     Alabama        52423.0
39             AL  total  1993   4214202.0     Alabama        52423.0
43             AL  total  1992   4154014.0     Alabama        52423.0
44             AL  total  1991   4099156.0     Alabama        52423.0
47             AL  total  1990   4050055.0     Alabama        52423.0
97             AZ  total  2012   6551149.0     Arizona       114006.0
99             AZ  total  2011   6468796.0     Arizona       114006.0
101            AZ  total  2010   6408790.0     Arizona       114006.0
103            AZ  total  2013   6626624.0     Arizona       114006.0
104            AZ  total  2009   6343154.0     Arizona       114006.0
106            AZ  total  2007   6167681.0     Arizona       114006.0
...           ...    ...   ...         ...         ...            ...
2292           WA  total  2007   6461587.0  Washington        71303.0
2295           WA  total  2013   6971406.0  Washington        71303.0
2296           WA  total  2009   6667426.0  Washington        71303.0
2298           WA  total  2010   6742256.0  Washington        71303.0
2301           WA  total  2011   6821481.0  Washington        71303.0
2303           WA  total  2012   6895318.0  Washington        71303.0
2353           WI  total  1990   4904562.0   Wisconsin        65503.0
2354           WI  total  1991   4964343.0   Wisconsin        65503.0
2356           WI  total  1993   5084889.0   Wisconsin        65503.0
2359           WI  total  1992   5025398.0   Wisconsin        65503.0
2361           WI  total  1994   5133678.0   Wisconsin        65503.0
2362           WI  total  1995   5184836.0   Wisconsin        65503.0
2365           WI  total  1996   5229986.0   Wisconsin        65503.0
2367           WI  total  1998   5297673.0   Wisconsin        65503.0
2368           WI  total  1997   5266213.0   Wisconsin        65503.0
2370           WI  total  1999   5332666.0   Wisconsin        65503.0
2372           WI  total  2000   5373999.0   Wisconsin        65503.0
2374           WI  total  2001   5406835.0   Wisconsin        65503.0
2376           WI  total  2002   5445162.0   Wisconsin        65503.0
2378           WI  total  2004   5514026.0   Wisconsin        65503.0
2380           WI  total  2003   5479203.0   Wisconsin        65503.0
2382           WI  total  2005   5546166.0   Wisconsin        65503.0
2384           WI  total  2006   5577655.0   Wisconsin        65503.0
2386           WI  total  2008   5640996.0   Wisconsin        65503.0
2388           WI  total  2007   5610775.0   Wisconsin        65503.0
2391           WI  total  2013   5742713.0   Wisconsin        65503.0
2392           WI  total  2009   5669264.0   Wisconsin        65503.0
2394           WI  total  2010   5689060.0   Wisconsin        65503.0
2397           WI  total  2011   5708785.0   Wisconsin        65503.0
2399           WI  total  2012   5724554.0   Wisconsin        65503.0

[552 rows x 6 columns]